Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG60_DFP/1.0.17/edc/PIC32CX1025SG60128.PIC
      <edc:SFRDef ltx:memberofperipheral="TPIU" edc:cname="DEVTYPE" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0xE0040FCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TPIU">
            <edc:SFRFieldDef edc:cname="SubType" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MajorType" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x30" edc:_addr="0xE0040FD0"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CR" edc:nzwidth="0x20" edc:access="---n------n---nn--n-nnnnnnnn---n" edc:por="00000000000000000000010000010001" edc:mclr="00000000000000000000010000010001" edc:impl="0x10232FF1" edc:_addr="0xE0041000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ETM">
            <edc:SFRFieldDef edc:cname="ETMPD" edc:nzwidth="0x1" edc:desc="ETM Power Down"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PORTSIZE" edc:nzwidth="0x3" edc:desc="Port Size bits 2:0"/>
            <edc:SFRFieldDef edc:cname="STALL" edc:nzwidth="0x1" edc:desc="Stall Processor"/>
            <edc:SFRFieldDef edc:cname="BROUT" edc:nzwidth="0x1" edc:desc="Branch Output"/>
            <edc:SFRFieldDef edc:cname="DBGRQ" edc:nzwidth="0x1" edc:desc="Debug Request Control"/>
            <edc:SFRFieldDef edc:cname="PROG" edc:nzwidth="0x1" edc:desc="ETM Programming"/>
            <edc:SFRFieldDef edc:cname="PORTSEL" edc:nzwidth="0x1" edc:desc="ETM Port Select"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PORTMODE2" edc:nzwidth="0x1" edc:desc="Port Mode bit 2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PORTMODE" edc:nzwidth="0x2" edc:desc="Port Mode bits 1:0"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PORTSIZE3" edc:nzwidth="0x1" edc:desc="Port Size bit 3"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TSEN" edc:nzwidth="0x1" edc:desc="TimeStamp Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CCR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="10001100100000000010000000000000" edc:mclr="10001100100000000010000000000000" edc:_addr="0xE0041004"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="TRIGGER" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0041008"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE004100C"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="SR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0041010"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="SCR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000100000110100001001" edc:mclr="00000000000000100000110100001001" edc:_addr="0xE0041014"/>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0xE0041018"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="TEEVR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0041020"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="TECR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0041024"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="FFLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0041028"/>
      <edc:AdjustPoint edc:offset="0x114" edc:_addr="0xE004102C"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CNTRLDVR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0041140"/>
      <edc:AdjustPoint edc:offset="0x9C" edc:_addr="0xE0041144"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="SYNCFR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000010000000000" edc:mclr="00000000000000000000010000000000" edc:_addr="0xE00411E0"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="IDR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="01000001000101001111001001010000" edc:mclr="01000001000101001111001001010000" edc:_addr="0xE00411E4"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CCER" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00011000010101000001100000000000" edc:mclr="00011000010101000001100000000000" edc:_addr="0xE00411E8"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE00411EC"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="TESSEICR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE00411F0"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE00411F4"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="TSEVT" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE00411F8"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE00411FC"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="TRACEIDR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0041200"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE0041204"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="IDR2" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0041208"/>
      <edc:AdjustPoint edc:offset="0x108" edc:_addr="0xE004120C"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="PDSR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000001" edc:mclr="00000000000000000000000000000001" edc:_addr="0xE0041314"/>
      <edc:AdjustPoint edc:offset="0xBC8" edc:_addr="0xE0041318"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="ITMISCIN" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE0041EE0"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE0041EE4"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="ITTRIGOUT" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0xE0041EE8"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE0041EEC"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="ITATBCTR2" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE0041EF0"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE0041EF4"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="ITATBCTR0" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0xE0041EF8"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE0041EFC"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="ITCTRL" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1" edc:_addr="0xE0041F00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ETM">
            <edc:SFRFieldDef edc:cname="INTEGRATION" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x9C" edc:_addr="0xE0041F04"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CLAIMSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0041FA0"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CLAIMCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0041FA4"/>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0xE0041FA8"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="LAR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0xE0041FB0"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="LSR" edc:nzwidth="0x20" edc:access="-----------------------------rrr" edc:impl="0x7" edc:_addr="0xE0041FB4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ETM">
            <edc:SFRFieldDef edc:cname="Present" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Access" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ByteAcc" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="AUTHSTATUS" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE0041FB8"/>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0xE0041FBC"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="DEVTYPE" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000010011" edc:mclr="00000000000000000000000000010011" edc:_addr="0xE0041FCC"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="PIDR4" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000100" edc:mclr="00000000000000000000000000000100" edc:_addr="0xE0041FD0"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="PIDR5" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0041FD4"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="PIDR6" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0041FD8"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="PIDR7" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0041FDC"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="PIDR0" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000100101" edc:mclr="00000000000000000000000000100101" edc:_addr="0xE0041FE0"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="PIDR1" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000010111001" edc:mclr="00000000000000000000000010111001" edc:_addr="0xE0041FE4"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="PIDR2" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000001011" edc:mclr="00000000000000000000000000001011" edc:_addr="0xE0041FE8"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="PIDR3" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0041FEC"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CIDR0" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000001101" edc:mclr="00000000000000000000000000001101" edc:_addr="0xE0041FF0"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CIDR1" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000010010000" edc:mclr="00000000000000000000000010010000" edc:_addr="0xE0041FF4"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CIDR2" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000101" edc:mclr="00000000000000000000000000000101" edc:_addr="0xE0041FF8"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CIDR3" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000010110001" edc:mclr="00000000000000000000000010110001" edc:_addr="0xE0041FFC"/>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:regionid="SCS" edc:beginaddr="0xE000E000" edc:endaddr="0xE000F000" edc:rw="rw"/>
    <edc:SFRDataSector edc:regionid="PERIPHERALS" edc:beginaddr="0x40000000" edc:endaddr="0x46000238" edc:rw="rw">
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="WRCTRL" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFF" edc:_addr="0x40000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PERID" edc:nzwidth="0x10" edc:desc="Peripheral identifier"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Peripheral access control key">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="No action" edc:when="(field &amp; 0xFF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CLR" edc:desc="Clear protection" edc:when="(field &amp; 0xFF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="Set protection" edc:when="(field &amp; 0xFF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SETLCK" edc:desc="Set and lock protection" edc:when="(field &amp; 0xFF) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="EVCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40000004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="ERREO" edc:nzwidth="0x1" edc:desc="Peripheral acess error event output"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x40000005"/>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="INTENCLR" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40000008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="ERR" edc:nzwidth="0x1" edc:desc="Peripheral access error interrupt disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="INTENSET" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40000009">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="ERR" edc:nzwidth="0x1" edc:desc="Peripheral access error interrupt enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x6" edc:_addr="0x4000000A"/>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="INTFLAGAHB" edc:nzwidth="0x20" edc:access="-----------------nnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FFF" edc:_addr="0x40000010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="FLASH_" edc:nzwidth="0x1" edc:desc="FLASH"/>
            <edc:SFRFieldDef edc:cname="FLASH_ALT_" edc:nzwidth="0x1" edc:desc="FLASH_ALT"/>
            <edc:SFRFieldDef edc:cname="SEEPROM_" edc:nzwidth="0x1" edc:desc="SEEPROM"/>
            <edc:SFRFieldDef edc:cname="RAMCM4S_" edc:nzwidth="0x1" edc:desc="RAMCM4S"/>
            <edc:SFRFieldDef edc:cname="RAMPPPDSU_" edc:nzwidth="0x1" edc:desc="RAMPPPDSU"/>
            <edc:SFRFieldDef edc:cname="RAMDMAWR_" edc:nzwidth="0x1" edc:desc="RAMDMAWR"/>
            <edc:SFRFieldDef edc:cname="RAMDMACICM_" edc:nzwidth="0x1" edc:desc="RAMDMACICM"/>
            <edc:SFRFieldDef edc:cname="HPB0_" edc:nzwidth="0x1" edc:desc="HPB0"/>
            <edc:SFRFieldDef edc:cname="HPB1_" edc:nzwidth="0x1" edc:desc="HPB1"/>
            <edc:SFRFieldDef edc:cname="HPB2_" edc:nzwidth="0x1" edc:desc="HPB2"/>
            <edc:SFRFieldDef edc:cname="HPB3_" edc:nzwidth="0x1" edc:desc="HPB3"/>
            <edc:SFRFieldDef edc:cname="PUKCC_" edc:nzwidth="0x1" edc:desc="PUKCC"/>
            <edc:SFRFieldDef edc:cname="SDHC0_" edc:nzwidth="0x1" edc:desc="SDHC0"/>
            <edc:SFRFieldDef edc:cname="SDHC1_" edc:nzwidth="0x1" edc:desc="SDHC1"/>
            <edc:SFRFieldDef edc:cname="QSPI_" edc:nzwidth="0x1" edc:desc="QSPI"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="INTFLAGA" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x40000014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PAC_" edc:nzwidth="0x1" edc:desc="PAC"/>
            <edc:SFRFieldDef edc:cname="PM_" edc:nzwidth="0x1" edc:desc="PM"/>
            <edc:SFRFieldDef edc:cname="MCLK_" edc:nzwidth="0x1" edc:desc="MCLK"/>
            <edc:SFRFieldDef edc:cname="RSTC_" edc:nzwidth="0x1" edc:desc="RSTC"/>
            <edc:SFRFieldDef edc:cname="OSCCTRL_" edc:nzwidth="0x1" edc:desc="OSCCTRL"/>
            <edc:SFRFieldDef edc:cname="OSC32KCTRL_" edc:nzwidth="0x1" edc:desc="OSC32KCTRL"/>
            <edc:SFRFieldDef edc:cname="SUPC_" edc:nzwidth="0x1" edc:desc="SUPC"/>
            <edc:SFRFieldDef edc:cname="GCLK_" edc:nzwidth="0x1" edc:desc="GCLK"/>
            <edc:SFRFieldDef edc:cname="WDT_" edc:nzwidth="0x1" edc:desc="WDT"/>
            <edc:SFRFieldDef edc:cname="RTC_" edc:nzwidth="0x1" edc:desc="RTC"/>
            <edc:SFRFieldDef edc:cname="EIC_" edc:nzwidth="0x1" edc:desc="EIC"/>
            <edc:SFRFieldDef edc:cname="FREQM_" edc:nzwidth="0x1" edc:desc="FREQM"/>
            <edc:SFRFieldDef edc:cname="SERCOM0_" edc:nzwidth="0x1" edc:desc="SERCOM0"/>
            <edc:SFRFieldDef edc:cname="SERCOM1_" edc:nzwidth="0x1" edc:desc="SERCOM1"/>
            <edc:SFRFieldDef edc:cname="TC0_" edc:nzwidth="0x1" edc:desc="TC0"/>
            <edc:SFRFieldDef edc:cname="TC1_" edc:nzwidth="0x1" edc:desc="TC1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="INTFLAGB" edc:nzwidth="0x20" edc:access="---------------n-nnnnnn-n-nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x17EBF" edc:_addr="0x40000018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="USB_" edc:nzwidth="0x1" edc:desc="USB"/>
            <edc:SFRFieldDef edc:cname="DSU_" edc:nzwidth="0x1" edc:desc="DSU"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_" edc:nzwidth="0x1" edc:desc="NVMCTRL"/>
            <edc:SFRFieldDef edc:cname="CMCC_" edc:nzwidth="0x1" edc:desc="CMCC"/>
            <edc:SFRFieldDef edc:cname="PORT_" edc:nzwidth="0x1" edc:desc="PORT"/>
            <edc:SFRFieldDef edc:cname="DMAC_" edc:nzwidth="0x1" edc:desc="DMAC"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EVSYS_" edc:nzwidth="0x1" edc:desc="EVSYS"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM2_" edc:nzwidth="0x1" edc:desc="SERCOM2"/>
            <edc:SFRFieldDef edc:cname="SERCOM3_" edc:nzwidth="0x1" edc:desc="SERCOM3"/>
            <edc:SFRFieldDef edc:cname="TCC0_" edc:nzwidth="0x1" edc:desc="TCC0"/>
            <edc:SFRFieldDef edc:cname="TCC1_" edc:nzwidth="0x1" edc:desc="TCC1"/>
            <edc:SFRFieldDef edc:cname="TC2_" edc:nzwidth="0x1" edc:desc="TC2"/>
            <edc:SFRFieldDef edc:cname="TC3_" edc:nzwidth="0x1" edc:desc="TC3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RAMECC_" edc:nzwidth="0x1" edc:desc="RAMECC"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="INTFLAGC" edc:nzwidth="0x20" edc:access="-----------------nnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FFF" edc:_addr="0x4000001C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="CAN0_" edc:nzwidth="0x1" edc:desc="CAN0"/>
            <edc:SFRFieldDef edc:cname="CAN1_" edc:nzwidth="0x1" edc:desc="CAN1"/>
            <edc:SFRFieldDef edc:cname="GMAC_" edc:nzwidth="0x1" edc:desc="GMAC"/>
            <edc:SFRFieldDef edc:cname="TCC2_" edc:nzwidth="0x1" edc:desc="TCC2"/>
            <edc:SFRFieldDef edc:cname="TCC3_" edc:nzwidth="0x1" edc:desc="TCC3"/>
            <edc:SFRFieldDef edc:cname="TC4_" edc:nzwidth="0x1" edc:desc="TC4"/>
            <edc:SFRFieldDef edc:cname="TC5_" edc:nzwidth="0x1" edc:desc="TC5"/>
            <edc:SFRFieldDef edc:cname="PDEC_" edc:nzwidth="0x1" edc:desc="PDEC"/>
            <edc:SFRFieldDef edc:cname="AC_" edc:nzwidth="0x1" edc:desc="AC"/>
            <edc:SFRFieldDef edc:cname="AES_" edc:nzwidth="0x1" edc:desc="AES"/>
            <edc:SFRFieldDef edc:cname="TRNG_" edc:nzwidth="0x1" edc:desc="TRNG"/>
            <edc:SFRFieldDef edc:cname="ICM_" edc:nzwidth="0x1" edc:desc="ICM"/>
            <edc:SFRFieldDef edc:cname="PUKCC_" edc:nzwidth="0x1" edc:desc="PUKCC"/>
            <edc:SFRFieldDef edc:cname="QSPI_" edc:nzwidth="0x1" edc:desc="QSPI"/>
            <edc:SFRFieldDef edc:cname="CCL_" edc:nzwidth="0x1" edc:desc="CCL"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="INTFLAGD" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFF" edc:_addr="0x40000020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="SERCOM4_" edc:nzwidth="0x1" edc:desc="SERCOM4"/>
            <edc:SFRFieldDef edc:cname="SERCOM5_" edc:nzwidth="0x1" edc:desc="SERCOM5"/>
            <edc:SFRFieldDef edc:cname="SERCOM6_" edc:nzwidth="0x1" edc:desc="SERCOM6"/>
            <edc:SFRFieldDef edc:cname="SERCOM7_" edc:nzwidth="0x1" edc:desc="SERCOM7"/>
            <edc:SFRFieldDef edc:cname="TCC4_" edc:nzwidth="0x1" edc:desc="TCC4"/>
            <edc:SFRFieldDef edc:cname="TC6_" edc:nzwidth="0x1" edc:desc="TC6"/>
            <edc:SFRFieldDef edc:cname="TC7_" edc:nzwidth="0x1" edc:desc="TC7"/>
            <edc:SFRFieldDef edc:cname="ADC0_" edc:nzwidth="0x1" edc:desc="ADC0"/>
            <edc:SFRFieldDef edc:cname="ADC1_" edc:nzwidth="0x1" edc:desc="ADC1"/>
            <edc:SFRFieldDef edc:cname="DAC_" edc:nzwidth="0x1" edc:desc="DAC"/>
            <edc:SFRFieldDef edc:cname="I2S_" edc:nzwidth="0x1" edc:desc="I2S"/>
            <edc:SFRFieldDef edc:cname="PCC_" edc:nzwidth="0x1" edc:desc="PCC"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
