Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG60_DFP/1.0.17/edc/PIC32CX1025SG60128.PIC
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="DFLLCTRLA" edc:nzwidth="0x8" edc:access="nn----n-" edc:por="10000010" edc:mclr="10000010" edc:impl="0xC2" edc:_addr="0x4000101C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="DFLL Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:nzwidth="0x1" edc:desc="On Demand Control"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x4000101D"/>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="DFLLCTRLB" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x40001020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="MODE" edc:nzwidth="0x1" edc:desc="Operating Mode Selection"/>
            <edc:SFRFieldDef edc:cname="STABLE" edc:nzwidth="0x1" edc:desc="Stable DFLL Frequency"/>
            <edc:SFRFieldDef edc:cname="LLAW" edc:nzwidth="0x1" edc:desc="Lose Lock After Wake"/>
            <edc:SFRFieldDef edc:cname="USBCRM" edc:nzwidth="0x1" edc:desc="USB Clock Recovery Mode"/>
            <edc:SFRFieldDef edc:cname="CCDIS" edc:nzwidth="0x1" edc:desc="Chill Cycle Disable"/>
            <edc:SFRFieldDef edc:cname="QLDIS" edc:nzwidth="0x1" edc:desc="Quick Lock Disable"/>
            <edc:SFRFieldDef edc:cname="BPLCKC" edc:nzwidth="0x1" edc:desc="Bypass Coarse Lock"/>
            <edc:SFRFieldDef edc:cname="WAITLOCK" edc:nzwidth="0x1" edc:desc="Wait Lock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x40001021"/>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="DFLLVAL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnn--nnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFCFF" edc:_addr="0x40001024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="FINE" edc:nzwidth="0x8" edc:desc="Fine Value"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="COARSE" edc:nzwidth="0x6" edc:desc="Coarse Value"/>
            <edc:SFRFieldDef edc:cname="DIFF" edc:nzwidth="0x10" edc:desc="Multiplication Ratio Difference"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="DFLLMUL" edc:nzwidth="0x20" edc:access="nnnnnn--nnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFCFFFFFF" edc:_addr="0x40001028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="MUL" edc:nzwidth="0x10" edc:desc="DFLL Multiply Factor"/>
            <edc:SFRFieldDef edc:cname="FSTEP" edc:nzwidth="0x8" edc:desc="Fine Maximum Step"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CSTEP" edc:nzwidth="0x6" edc:desc="Coarse Maximum Step"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="DFLLSYNC" edc:nzwidth="0x8" edc:access="---nnnn-" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1E" edc:_addr="0x4000102C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ENABLE Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="DFLLCTRLB" edc:nzwidth="0x1" edc:desc="DFLLCTRLB Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="DFLLVAL" edc:nzwidth="0x1" edc:desc="DFLLVAL Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="DFLLMUL" edc:nzwidth="0x1" edc:desc="DFLLMUL Synchronization Busy"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x4000102D"/>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="DPLL0DPLLCTRLA" edc:nzwidth="0x8" edc:access="nn----n-" edc:por="10000000" edc:mclr="10000000" edc:impl="0xC2" edc:_addr="0x40001030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="DPLL Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:nzwidth="0x1" edc:desc="On Demand Control"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x40001031"/>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="DPLL0DPLLRATIO" edc:nzwidth="0x20" edc:access="-----------nnnnn---nnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1F1FFF" edc:_addr="0x40001034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="LDR" edc:nzwidth="0xD" edc:desc="Loop Divider Ratio"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="LDRFRAC" edc:nzwidth="0x5" edc:desc="Loop Divider Ratio Fractional Part"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="DPLL0DPLLCTRLB" edc:nzwidth="0x20" edc:access="-----nnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000100000" edc:mclr="00000000000000000000000000100000" edc:impl="0x7FFFFFF" edc:_addr="0x40001038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="FILTER" edc:nzwidth="0x4" edc:desc="Proportional Integral Filter Selection">
              <edc:SFRFieldSemantic edc:cname="FILTER1" edc:desc="Bandwidth = 92.7Khz and Damping Factor = 0.76" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="FILTER2" edc:desc="Bandwidth = 131Khz and Damping Factor = 1.08" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FILTER3" edc:desc="Bandwidth = 46.4Khz and Damping Factor = 0.38" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="FILTER4" edc:desc="Bandwidth = 65.6Khz and Damping Factor = 0.54" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="FILTER5" edc:desc="Bandwidth = 131Khz and Damping Factor = 0.56" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="FILTER6" edc:desc="Bandwidth = 185Khz and Damping Factor = 0.79" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="FILTER7" edc:desc="Bandwidth = 65.6Khz and Damping Factor = 0.28" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="FILTER8" edc:desc="Bandwidth = 92.7Khz and Damping Factor = 0.39" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="FILTER9" edc:desc="Bandwidth = 46.4Khz and Damping Factor = 1.49" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="FILTER10" edc:desc="Bandwidth = 65.6Khz and Damping Factor = 2.11" edc:when="(field &amp; 0xF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="FILTER11" edc:desc="Bandwidth = 23.2Khz and Damping Factor = 0.75" edc:when="(field &amp; 0xF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="FILTER12" edc:desc="Bandwidth = 32.8Khz and Damping Factor = 1.06" edc:when="(field &amp; 0xF) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="FILTER13" edc:desc="Bandwidth = 65.6Khz and Damping Factor = 1.07" edc:when="(field &amp; 0xF) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="FILTER14" edc:desc="Bandwidth = 92.7Khz and Damping Factor = 1.51" edc:when="(field &amp; 0xF) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="FILTER15" edc:desc="Bandwidth = 32.8Khz and Damping Factor = 0.53" edc:when="(field &amp; 0xF) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="FILTER16" edc:desc="Bandwidth = 46.4Khz and Damping Factor = 0.75" edc:when="(field &amp; 0xF) == 0x0F"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WUF" edc:nzwidth="0x1" edc:desc="Wake Up Fast"/>
            <edc:SFRFieldDef edc:cname="REFCLK" edc:nzwidth="0x3" edc:desc="Reference Clock Selection">
              <edc:SFRFieldSemantic edc:cname="GCLK" edc:desc="Dedicated GCLK clock reference" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="XOSC32" edc:desc="XOSC32K clock reference" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="XOSC0" edc:desc="XOSC0 clock reference" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="XOSC1" edc:desc="XOSC1 clock reference" edc:when="(field &amp; 0x7) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LTIME" edc:nzwidth="0x3" edc:desc="Lock Time">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="No time-out. Automatic lock" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="800US" edc:desc="Time-out if no lock within 800us" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="900US" edc:desc="Time-out if no lock within 900us" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="1MS" edc:desc="Time-out if no lock within 1ms" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="1P1MS" edc:desc="Time-out if no lock within 1.1ms" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LBYPASS" edc:nzwidth="0x1" edc:desc="Lock Bypass"/>
            <edc:SFRFieldDef edc:cname="DCOFILTER" edc:nzwidth="0x3" edc:desc="Sigma-Delta DCO Filter Selection">
              <edc:SFRFieldSemantic edc:cname="FILTER1" edc:desc="Capacitor(pF) = 0.5 and Bandwidth Fn (MHz) = 3.21" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="FILTER2" edc:desc="Capacitor(pF) = 1 and Bandwidth Fn (MHz) = 1.6" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FILTER3" edc:desc="Capacitor(pF) = 1.5 and Bandwidth Fn (MHz) = 1.1" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="FILTER4" edc:desc="Capacitor(pF) = 2 and Bandwidth Fn (MHz) = 0.8" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="FILTER5" edc:desc="Capacitor(pF) = 2.5 and Bandwidth Fn (MHz) = 0.64" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="FILTER6" edc:desc="Capacitor(pF) = 3 and Bandwidth Fn (MHz) = 0.55" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="FILTER7" edc:desc="Capacitor(pF) = 3.5 and Bandwidth Fn (MHz) = 0.45" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="FILTER8" edc:desc="Capacitor(pF) = 4 and Bandwidth Fn (MHz) = 0.4" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DCOEN" edc:nzwidth="0x1" edc:desc="DCO Filter Enable"/>
            <edc:SFRFieldDef edc:cname="DIV" edc:nzwidth="0xB" edc:desc="Clock Divider"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="DPLL0DPLLSYNCBUSY" edc:nzwidth="0x20" edc:access="-----------------------------rr-" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x6" edc:_addr="0x4000103C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="DPLL Enable Synchronization Status"/>
            <edc:SFRFieldDef edc:cname="DPLLRATIO" edc:nzwidth="0x1" edc:desc="DPLL Loop Divider Ratio Synchronization Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="DPLL0DPLLSTATUS" edc:nzwidth="0x20" edc:access="------------------------------rr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3" edc:_addr="0x40001040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="LOCK" edc:nzwidth="0x1" edc:desc="DPLL Lock Status"/>
            <edc:SFRFieldDef edc:cname="CLKRDY" edc:nzwidth="0x1" edc:desc="DPLL Clock Ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
