Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG60_DFP/1.0.17/edc/PIC32CX1025SG60128.PIC
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="TXBRP" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420000CC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="TRP0" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 0"/>
            <edc:SFRFieldDef edc:cname="TRP1" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 1"/>
            <edc:SFRFieldDef edc:cname="TRP2" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 2"/>
            <edc:SFRFieldDef edc:cname="TRP3" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 3"/>
            <edc:SFRFieldDef edc:cname="TRP4" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 4"/>
            <edc:SFRFieldDef edc:cname="TRP5" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 5"/>
            <edc:SFRFieldDef edc:cname="TRP6" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 6"/>
            <edc:SFRFieldDef edc:cname="TRP7" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 7"/>
            <edc:SFRFieldDef edc:cname="TRP8" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 8"/>
            <edc:SFRFieldDef edc:cname="TRP9" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 9"/>
            <edc:SFRFieldDef edc:cname="TRP10" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 10"/>
            <edc:SFRFieldDef edc:cname="TRP11" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 11"/>
            <edc:SFRFieldDef edc:cname="TRP12" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 12"/>
            <edc:SFRFieldDef edc:cname="TRP13" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 13"/>
            <edc:SFRFieldDef edc:cname="TRP14" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 14"/>
            <edc:SFRFieldDef edc:cname="TRP15" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 15"/>
            <edc:SFRFieldDef edc:cname="TRP16" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 16"/>
            <edc:SFRFieldDef edc:cname="TRP17" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 17"/>
            <edc:SFRFieldDef edc:cname="TRP18" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 18"/>
            <edc:SFRFieldDef edc:cname="TRP19" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 19"/>
            <edc:SFRFieldDef edc:cname="TRP20" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 20"/>
            <edc:SFRFieldDef edc:cname="TRP21" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 21"/>
            <edc:SFRFieldDef edc:cname="TRP22" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 22"/>
            <edc:SFRFieldDef edc:cname="TRP23" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 23"/>
            <edc:SFRFieldDef edc:cname="TRP24" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 24"/>
            <edc:SFRFieldDef edc:cname="TRP25" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 25"/>
            <edc:SFRFieldDef edc:cname="TRP26" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 26"/>
            <edc:SFRFieldDef edc:cname="TRP27" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 27"/>
            <edc:SFRFieldDef edc:cname="TRP28" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 28"/>
            <edc:SFRFieldDef edc:cname="TRP29" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 29"/>
            <edc:SFRFieldDef edc:cname="TRP30" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 30"/>
            <edc:SFRFieldDef edc:cname="TRP31" edc:nzwidth="0x1" edc:desc="Transmission Request Pending 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="TXBAR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420000D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="AR0" edc:nzwidth="0x1" edc:desc="Add Request 0"/>
            <edc:SFRFieldDef edc:cname="AR1" edc:nzwidth="0x1" edc:desc="Add Request 1"/>
            <edc:SFRFieldDef edc:cname="AR2" edc:nzwidth="0x1" edc:desc="Add Request 2"/>
            <edc:SFRFieldDef edc:cname="AR3" edc:nzwidth="0x1" edc:desc="Add Request 3"/>
            <edc:SFRFieldDef edc:cname="AR4" edc:nzwidth="0x1" edc:desc="Add Request 4"/>
            <edc:SFRFieldDef edc:cname="AR5" edc:nzwidth="0x1" edc:desc="Add Request 5"/>
            <edc:SFRFieldDef edc:cname="AR6" edc:nzwidth="0x1" edc:desc="Add Request 6"/>
            <edc:SFRFieldDef edc:cname="AR7" edc:nzwidth="0x1" edc:desc="Add Request 7"/>
            <edc:SFRFieldDef edc:cname="AR8" edc:nzwidth="0x1" edc:desc="Add Request 8"/>
            <edc:SFRFieldDef edc:cname="AR9" edc:nzwidth="0x1" edc:desc="Add Request 9"/>
            <edc:SFRFieldDef edc:cname="AR10" edc:nzwidth="0x1" edc:desc="Add Request 10"/>
            <edc:SFRFieldDef edc:cname="AR11" edc:nzwidth="0x1" edc:desc="Add Request 11"/>
            <edc:SFRFieldDef edc:cname="AR12" edc:nzwidth="0x1" edc:desc="Add Request 12"/>
            <edc:SFRFieldDef edc:cname="AR13" edc:nzwidth="0x1" edc:desc="Add Request 13"/>
            <edc:SFRFieldDef edc:cname="AR14" edc:nzwidth="0x1" edc:desc="Add Request 14"/>
            <edc:SFRFieldDef edc:cname="AR15" edc:nzwidth="0x1" edc:desc="Add Request 15"/>
            <edc:SFRFieldDef edc:cname="AR16" edc:nzwidth="0x1" edc:desc="Add Request 16"/>
            <edc:SFRFieldDef edc:cname="AR17" edc:nzwidth="0x1" edc:desc="Add Request 17"/>
            <edc:SFRFieldDef edc:cname="AR18" edc:nzwidth="0x1" edc:desc="Add Request 18"/>
            <edc:SFRFieldDef edc:cname="AR19" edc:nzwidth="0x1" edc:desc="Add Request 19"/>
            <edc:SFRFieldDef edc:cname="AR20" edc:nzwidth="0x1" edc:desc="Add Request 20"/>
            <edc:SFRFieldDef edc:cname="AR21" edc:nzwidth="0x1" edc:desc="Add Request 21"/>
            <edc:SFRFieldDef edc:cname="AR22" edc:nzwidth="0x1" edc:desc="Add Request 22"/>
            <edc:SFRFieldDef edc:cname="AR23" edc:nzwidth="0x1" edc:desc="Add Request 23"/>
            <edc:SFRFieldDef edc:cname="AR24" edc:nzwidth="0x1" edc:desc="Add Request 24"/>
            <edc:SFRFieldDef edc:cname="AR25" edc:nzwidth="0x1" edc:desc="Add Request 25"/>
            <edc:SFRFieldDef edc:cname="AR26" edc:nzwidth="0x1" edc:desc="Add Request 26"/>
            <edc:SFRFieldDef edc:cname="AR27" edc:nzwidth="0x1" edc:desc="Add Request 27"/>
            <edc:SFRFieldDef edc:cname="AR28" edc:nzwidth="0x1" edc:desc="Add Request 28"/>
            <edc:SFRFieldDef edc:cname="AR29" edc:nzwidth="0x1" edc:desc="Add Request 29"/>
            <edc:SFRFieldDef edc:cname="AR30" edc:nzwidth="0x1" edc:desc="Add Request 30"/>
            <edc:SFRFieldDef edc:cname="AR31" edc:nzwidth="0x1" edc:desc="Add Request 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="TXBCR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420000D4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="CR0" edc:nzwidth="0x1" edc:desc="Cancellation Request 0"/>
            <edc:SFRFieldDef edc:cname="CR1" edc:nzwidth="0x1" edc:desc="Cancellation Request 1"/>
            <edc:SFRFieldDef edc:cname="CR2" edc:nzwidth="0x1" edc:desc="Cancellation Request 2"/>
            <edc:SFRFieldDef edc:cname="CR3" edc:nzwidth="0x1" edc:desc="Cancellation Request 3"/>
            <edc:SFRFieldDef edc:cname="CR4" edc:nzwidth="0x1" edc:desc="Cancellation Request 4"/>
            <edc:SFRFieldDef edc:cname="CR5" edc:nzwidth="0x1" edc:desc="Cancellation Request 5"/>
            <edc:SFRFieldDef edc:cname="CR6" edc:nzwidth="0x1" edc:desc="Cancellation Request 6"/>
            <edc:SFRFieldDef edc:cname="CR7" edc:nzwidth="0x1" edc:desc="Cancellation Request 7"/>
            <edc:SFRFieldDef edc:cname="CR8" edc:nzwidth="0x1" edc:desc="Cancellation Request 8"/>
            <edc:SFRFieldDef edc:cname="CR9" edc:nzwidth="0x1" edc:desc="Cancellation Request 9"/>
            <edc:SFRFieldDef edc:cname="CR10" edc:nzwidth="0x1" edc:desc="Cancellation Request 10"/>
            <edc:SFRFieldDef edc:cname="CR11" edc:nzwidth="0x1" edc:desc="Cancellation Request 11"/>
            <edc:SFRFieldDef edc:cname="CR12" edc:nzwidth="0x1" edc:desc="Cancellation Request 12"/>
            <edc:SFRFieldDef edc:cname="CR13" edc:nzwidth="0x1" edc:desc="Cancellation Request 13"/>
            <edc:SFRFieldDef edc:cname="CR14" edc:nzwidth="0x1" edc:desc="Cancellation Request 14"/>
            <edc:SFRFieldDef edc:cname="CR15" edc:nzwidth="0x1" edc:desc="Cancellation Request 15"/>
            <edc:SFRFieldDef edc:cname="CR16" edc:nzwidth="0x1" edc:desc="Cancellation Request 16"/>
            <edc:SFRFieldDef edc:cname="CR17" edc:nzwidth="0x1" edc:desc="Cancellation Request 17"/>
            <edc:SFRFieldDef edc:cname="CR18" edc:nzwidth="0x1" edc:desc="Cancellation Request 18"/>
            <edc:SFRFieldDef edc:cname="CR19" edc:nzwidth="0x1" edc:desc="Cancellation Request 19"/>
            <edc:SFRFieldDef edc:cname="CR20" edc:nzwidth="0x1" edc:desc="Cancellation Request 20"/>
            <edc:SFRFieldDef edc:cname="CR21" edc:nzwidth="0x1" edc:desc="Cancellation Request 21"/>
            <edc:SFRFieldDef edc:cname="CR22" edc:nzwidth="0x1" edc:desc="Cancellation Request 22"/>
            <edc:SFRFieldDef edc:cname="CR23" edc:nzwidth="0x1" edc:desc="Cancellation Request 23"/>
            <edc:SFRFieldDef edc:cname="CR24" edc:nzwidth="0x1" edc:desc="Cancellation Request 24"/>
            <edc:SFRFieldDef edc:cname="CR25" edc:nzwidth="0x1" edc:desc="Cancellation Request 25"/>
            <edc:SFRFieldDef edc:cname="CR26" edc:nzwidth="0x1" edc:desc="Cancellation Request 26"/>
            <edc:SFRFieldDef edc:cname="CR27" edc:nzwidth="0x1" edc:desc="Cancellation Request 27"/>
            <edc:SFRFieldDef edc:cname="CR28" edc:nzwidth="0x1" edc:desc="Cancellation Request 28"/>
            <edc:SFRFieldDef edc:cname="CR29" edc:nzwidth="0x1" edc:desc="Cancellation Request 29"/>
            <edc:SFRFieldDef edc:cname="CR30" edc:nzwidth="0x1" edc:desc="Cancellation Request 30"/>
            <edc:SFRFieldDef edc:cname="CR31" edc:nzwidth="0x1" edc:desc="Cancellation Request 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN0" edc:cname="TXBTO" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420000D8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN0">
            <edc:SFRFieldDef edc:cname="TO0" edc:nzwidth="0x1" edc:desc="Transmission Occurred 0"/>
            <edc:SFRFieldDef edc:cname="TO1" edc:nzwidth="0x1" edc:desc="Transmission Occurred 1"/>
            <edc:SFRFieldDef edc:cname="TO2" edc:nzwidth="0x1" edc:desc="Transmission Occurred 2"/>
            <edc:SFRFieldDef edc:cname="TO3" edc:nzwidth="0x1" edc:desc="Transmission Occurred 3"/>
            <edc:SFRFieldDef edc:cname="TO4" edc:nzwidth="0x1" edc:desc="Transmission Occurred 4"/>
            <edc:SFRFieldDef edc:cname="TO5" edc:nzwidth="0x1" edc:desc="Transmission Occurred 5"/>
            <edc:SFRFieldDef edc:cname="TO6" edc:nzwidth="0x1" edc:desc="Transmission Occurred 6"/>
            <edc:SFRFieldDef edc:cname="TO7" edc:nzwidth="0x1" edc:desc="Transmission Occurred 7"/>
            <edc:SFRFieldDef edc:cname="TO8" edc:nzwidth="0x1" edc:desc="Transmission Occurred 8"/>
            <edc:SFRFieldDef edc:cname="TO9" edc:nzwidth="0x1" edc:desc="Transmission Occurred 9"/>
            <edc:SFRFieldDef edc:cname="TO10" edc:nzwidth="0x1" edc:desc="Transmission Occurred 10"/>
            <edc:SFRFieldDef edc:cname="TO11" edc:nzwidth="0x1" edc:desc="Transmission Occurred 11"/>
            <edc:SFRFieldDef edc:cname="TO12" edc:nzwidth="0x1" edc:desc="Transmission Occurred 12"/>
            <edc:SFRFieldDef edc:cname="TO13" edc:nzwidth="0x1" edc:desc="Transmission Occurred 13"/>
            <edc:SFRFieldDef edc:cname="TO14" edc:nzwidth="0x1" edc:desc="Transmission Occurred 14"/>
            <edc:SFRFieldDef edc:cname="TO15" edc:nzwidth="0x1" edc:desc="Transmission Occurred 15"/>
            <edc:SFRFieldDef edc:cname="TO16" edc:nzwidth="0x1" edc:desc="Transmission Occurred 16"/>
            <edc:SFRFieldDef edc:cname="TO17" edc:nzwidth="0x1" edc:desc="Transmission Occurred 17"/>
            <edc:SFRFieldDef edc:cname="TO18" edc:nzwidth="0x1" edc:desc="Transmission Occurred 18"/>
            <edc:SFRFieldDef edc:cname="TO19" edc:nzwidth="0x1" edc:desc="Transmission Occurred 19"/>
            <edc:SFRFieldDef edc:cname="TO20" edc:nzwidth="0x1" edc:desc="Transmission Occurred 20"/>
            <edc:SFRFieldDef edc:cname="TO21" edc:nzwidth="0x1" edc:desc="Transmission Occurred 21"/>
            <edc:SFRFieldDef edc:cname="TO22" edc:nzwidth="0x1" edc:desc="Transmission Occurred 22"/>
            <edc:SFRFieldDef edc:cname="TO23" edc:nzwidth="0x1" edc:desc="Transmission Occurred 23"/>
            <edc:SFRFieldDef edc:cname="TO24" edc:nzwidth="0x1" edc:desc="Transmission Occurred 24"/>
            <edc:SFRFieldDef edc:cname="TO25" edc:nzwidth="0x1" edc:desc="Transmission Occurred 25"/>
            <edc:SFRFieldDef edc:cname="TO26" edc:nzwidth="0x1" edc:desc="Transmission Occurred 26"/>
            <edc:SFRFieldDef edc:cname="TO27" edc:nzwidth="0x1" edc:desc="Transmission Occurred 27"/>
            <edc:SFRFieldDef edc:cname="TO28" edc:nzwidth="0x1" edc:desc="Transmission Occurred 28"/>
            <edc:SFRFieldDef edc:cname="TO29" edc:nzwidth="0x1" edc:desc="Transmission Occurred 29"/>
            <edc:SFRFieldDef edc:cname="TO30" edc:nzwidth="0x1" edc:desc="Transmission Occurred 30"/>
            <edc:SFRFieldDef edc:cname="TO31" edc:nzwidth="0x1" edc:desc="Transmission Occurred 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
