Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG60_DFP/1.0.17/edc/PIC32CX1025SG60128.PIC
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="TXBTIE" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420004E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="TIE0" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 0"/>
            <edc:SFRFieldDef edc:cname="TIE1" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 1"/>
            <edc:SFRFieldDef edc:cname="TIE2" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 2"/>
            <edc:SFRFieldDef edc:cname="TIE3" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 3"/>
            <edc:SFRFieldDef edc:cname="TIE4" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 4"/>
            <edc:SFRFieldDef edc:cname="TIE5" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 5"/>
            <edc:SFRFieldDef edc:cname="TIE6" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 6"/>
            <edc:SFRFieldDef edc:cname="TIE7" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 7"/>
            <edc:SFRFieldDef edc:cname="TIE8" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 8"/>
            <edc:SFRFieldDef edc:cname="TIE9" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 9"/>
            <edc:SFRFieldDef edc:cname="TIE10" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 10"/>
            <edc:SFRFieldDef edc:cname="TIE11" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 11"/>
            <edc:SFRFieldDef edc:cname="TIE12" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 12"/>
            <edc:SFRFieldDef edc:cname="TIE13" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 13"/>
            <edc:SFRFieldDef edc:cname="TIE14" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 14"/>
            <edc:SFRFieldDef edc:cname="TIE15" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 15"/>
            <edc:SFRFieldDef edc:cname="TIE16" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 16"/>
            <edc:SFRFieldDef edc:cname="TIE17" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 17"/>
            <edc:SFRFieldDef edc:cname="TIE18" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 18"/>
            <edc:SFRFieldDef edc:cname="TIE19" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 19"/>
            <edc:SFRFieldDef edc:cname="TIE20" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 20"/>
            <edc:SFRFieldDef edc:cname="TIE21" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 21"/>
            <edc:SFRFieldDef edc:cname="TIE22" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 22"/>
            <edc:SFRFieldDef edc:cname="TIE23" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 23"/>
            <edc:SFRFieldDef edc:cname="TIE24" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 24"/>
            <edc:SFRFieldDef edc:cname="TIE25" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 25"/>
            <edc:SFRFieldDef edc:cname="TIE26" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 26"/>
            <edc:SFRFieldDef edc:cname="TIE27" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 27"/>
            <edc:SFRFieldDef edc:cname="TIE28" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 28"/>
            <edc:SFRFieldDef edc:cname="TIE29" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 29"/>
            <edc:SFRFieldDef edc:cname="TIE30" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 30"/>
            <edc:SFRFieldDef edc:cname="TIE31" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="TXBCIE" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420004E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="CFIE0" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 0"/>
            <edc:SFRFieldDef edc:cname="CFIE1" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 1"/>
            <edc:SFRFieldDef edc:cname="CFIE2" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 2"/>
            <edc:SFRFieldDef edc:cname="CFIE3" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 3"/>
            <edc:SFRFieldDef edc:cname="CFIE4" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 4"/>
            <edc:SFRFieldDef edc:cname="CFIE5" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 5"/>
            <edc:SFRFieldDef edc:cname="CFIE6" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 6"/>
            <edc:SFRFieldDef edc:cname="CFIE7" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 7"/>
            <edc:SFRFieldDef edc:cname="CFIE8" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 8"/>
            <edc:SFRFieldDef edc:cname="CFIE9" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 9"/>
            <edc:SFRFieldDef edc:cname="CFIE10" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 10"/>
            <edc:SFRFieldDef edc:cname="CFIE11" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 11"/>
            <edc:SFRFieldDef edc:cname="CFIE12" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 12"/>
            <edc:SFRFieldDef edc:cname="CFIE13" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 13"/>
            <edc:SFRFieldDef edc:cname="CFIE14" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 14"/>
            <edc:SFRFieldDef edc:cname="CFIE15" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 15"/>
            <edc:SFRFieldDef edc:cname="CFIE16" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 16"/>
            <edc:SFRFieldDef edc:cname="CFIE17" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 17"/>
            <edc:SFRFieldDef edc:cname="CFIE18" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 18"/>
            <edc:SFRFieldDef edc:cname="CFIE19" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 19"/>
            <edc:SFRFieldDef edc:cname="CFIE20" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 20"/>
            <edc:SFRFieldDef edc:cname="CFIE21" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 21"/>
            <edc:SFRFieldDef edc:cname="CFIE22" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 22"/>
            <edc:SFRFieldDef edc:cname="CFIE23" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 23"/>
            <edc:SFRFieldDef edc:cname="CFIE24" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 24"/>
            <edc:SFRFieldDef edc:cname="CFIE25" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 25"/>
            <edc:SFRFieldDef edc:cname="CFIE26" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 26"/>
            <edc:SFRFieldDef edc:cname="CFIE27" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 27"/>
            <edc:SFRFieldDef edc:cname="CFIE28" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 28"/>
            <edc:SFRFieldDef edc:cname="CFIE29" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 29"/>
            <edc:SFRFieldDef edc:cname="CFIE30" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 30"/>
            <edc:SFRFieldDef edc:cname="CFIE31" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x420004E8"/>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="TXEFC" edc:nzwidth="0x20" edc:access="--nnnnnn--nnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F3FFFFF" edc:_addr="0x420004F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="EFSA" edc:nzwidth="0x10" edc:desc="Event FIFO Start Address"/>
            <edc:SFRFieldDef edc:cname="EFS" edc:nzwidth="0x6" edc:desc="Event FIFO Size"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EFWM" edc:nzwidth="0x6" edc:desc="Event FIFO Watermark"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CAN1" edc:cname="TXEFS" edc:nzwidth="0x20" edc:access="------rr---rrrrr---rrrrr--rrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x31F1F3F" edc:_addr="0x420004F4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="EFFL" edc:nzwidth="0x6" edc:desc="Event FIFO Fill Level"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EFGI" edc:nzwidth="0x5" edc:desc="Event FIFO Get Index"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EFPI" edc:nzwidth="0x5" edc:desc="Event FIFO Put Index"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EFF" edc:nzwidth="0x1" edc:desc="Event FIFO Full"/>
            <edc:SFRFieldDef edc:cname="TEFL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Element Lost"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
