Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG60_DFP/1.0.17/edc/PIC32CX1025SG60128.PIC
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="MCF" edc:nzwidth="0x20" edc:access="--------------rrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FFFF" edc:_addr="0x4200093C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="MCOL" edc:nzwidth="0x12" edc:desc="Multiple Collision"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="EC" edc:nzwidth="0x20" edc:access="----------------------rrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FF" edc:_addr="0x42000940">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="XCOL" edc:nzwidth="0xA" edc:desc="Excessive Collisions"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="LC" edc:nzwidth="0x20" edc:access="----------------------rrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FF" edc:_addr="0x42000944">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="LCOL" edc:nzwidth="0xA" edc:desc="Late Collisions"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="DTF" edc:nzwidth="0x20" edc:access="--------------rrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FFFF" edc:_addr="0x42000948">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="DEFT" edc:nzwidth="0x12" edc:desc="Deferred Transmission"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="CSE" edc:nzwidth="0x20" edc:access="----------------------rrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FF" edc:_addr="0x4200094C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="CSR" edc:nzwidth="0xA" edc:desc="Carrier Sense Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="ORLO" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42000950">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RXO" edc:nzwidth="0x20" edc:desc="Received Octets"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="ORHI" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x42000954">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RXO" edc:nzwidth="0x10" edc:desc="Received Octets"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="FR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42000958">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="FRX" edc:nzwidth="0x20" edc:desc="Frames Received without Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="BCFR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4200095C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="BFRX" edc:nzwidth="0x20" edc:desc="Broadcast Frames Received without Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="MFR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42000960">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="MFRX" edc:nzwidth="0x20" edc:desc="Multicast Frames Received without Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="PFR" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF" edc:_addr="0x42000964">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="PFRX" edc:nzwidth="0x10" edc:desc="Pause Frames Received Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="BFR64" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42000968">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="NFRX" edc:nzwidth="0x20" edc:desc="64 Byte Frames Received without Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GMAC" edc:cname="TBFR127" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4200096C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="NFRX" edc:nzwidth="0x20" edc:desc="65 to 127 Byte Frames Received without Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
