Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG60_DFP/1.0.17/edc/PIC32CX1025SG60128.PIC
      <edc:SFRDef ltx:memberofperipheral="ADC1" edc:cname="RESULT" edc:nzwidth="0x10" edc:access="rrrrrrrrrrrrrrrr" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:_addr="0x43002040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="RESULT" edc:nzwidth="0x10" edc:desc="Result Conversion Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x43002042"/>
      <edc:SFRDef ltx:memberofperipheral="ADC1" edc:cname="RESS" edc:nzwidth="0x10" edc:access="rrrrrrrrrrrrrrrr" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:_addr="0x43002044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="RESS" edc:nzwidth="0x10" edc:desc="Last ADC conversion result"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x43002046"/>
      <edc:SFRDef ltx:memberofperipheral="ADC1" edc:cname="CALIB" edc:nzwidth="0x10" edc:access="-----nnn-nnn-nnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x777" edc:_addr="0x43002048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="BIASCOMP" edc:nzwidth="0x3" edc:desc="Bias Comparator Scaling"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BIASR2R" edc:nzwidth="0x3" edc:desc="Bias R2R Ampli scaling"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BIASREFBUF" edc:nzwidth="0x3" edc:desc="Bias  Reference Buffer Scaling"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3B6" edc:_addr="0x4300204A"/>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x43002400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable DAC Controller"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="CTRLB" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000010" edc:mclr="00000010" edc:impl="0x7" edc:_addr="0x43002401">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="DIFF" edc:nzwidth="0x1" edc:desc="Differential mode enable"/>
            <edc:SFRFieldDef edc:cname="REFSEL" edc:nzwidth="0x2" edc:desc="Reference Selection for DAC0/1">
              <edc:SFRFieldSemantic edc:cname="VREFAU" edc:desc="External reference unbuffered" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="AVDD" edc:desc="Analog supply" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="VREFAB" edc:desc="External reference buffered" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="INTREF" edc:desc="Internal bandgap reference" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="EVCTRL" edc:nzwidth="0x8" edc:access="--nnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3F" edc:_addr="0x43002402">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="STARTEI0" edc:nzwidth="0x1" edc:desc="Start Conversion Event Input DAC 0"/>
            <edc:SFRFieldDef edc:cname="STARTEI1" edc:nzwidth="0x1" edc:desc="Start Conversion Event Input DAC 1"/>
            <edc:SFRFieldDef edc:cname="EMPTYEO0" edc:nzwidth="0x1" edc:desc="Data Buffer Empty Event Output DAC 0"/>
            <edc:SFRFieldDef edc:cname="EMPTYEO1" edc:nzwidth="0x1" edc:desc="Data Buffer Empty Event Output DAC 1"/>
            <edc:SFRFieldDef edc:cname="INVEI0" edc:nzwidth="0x1" edc:desc="Enable Invertion of DAC 0 input event"/>
            <edc:SFRFieldDef edc:cname="INVEI1" edc:nzwidth="0x1" edc:desc="Enable Invertion of DAC 1 input event"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x43002403"/>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="INTENCLR" edc:nzwidth="0x8" edc:access="----nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF" edc:_addr="0x43002404">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="UNDERRUN0" edc:nzwidth="0x1" edc:desc="Underrun 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERRUN1" edc:nzwidth="0x1" edc:desc="Underrun 1 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EMPTY0" edc:nzwidth="0x1" edc:desc="Data Buffer 0 Empty Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EMPTY1" edc:nzwidth="0x1" edc:desc="Data Buffer 1 Empty Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="INTENSET" edc:nzwidth="0x8" edc:access="----nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF" edc:_addr="0x43002405">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="UNDERRUN0" edc:nzwidth="0x1" edc:desc="Underrun 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERRUN1" edc:nzwidth="0x1" edc:desc="Underrun 1 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EMPTY0" edc:nzwidth="0x1" edc:desc="Data Buffer 0 Empty Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EMPTY1" edc:nzwidth="0x1" edc:desc="Data Buffer 1 Empty Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="INTFLAG" edc:nzwidth="0x8" edc:access="----nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF" edc:_addr="0x43002406">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="UNDERRUN0" edc:nzwidth="0x1" edc:desc="Result 0 Underrun"/>
            <edc:SFRFieldDef edc:cname="UNDERRUN1" edc:nzwidth="0x1" edc:desc="Result 1 Underrun"/>
            <edc:SFRFieldDef edc:cname="EMPTY0" edc:nzwidth="0x1" edc:desc="Data Buffer 0 Empty"/>
            <edc:SFRFieldDef edc:cname="EMPTY1" edc:nzwidth="0x1" edc:desc="Data Buffer 1 Empty"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="STATUS" edc:nzwidth="0x8" edc:access="----rrrr" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF" edc:_addr="0x43002407">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="READY0" edc:nzwidth="0x1" edc:desc="DAC 0 Startup Ready"/>
            <edc:SFRFieldDef edc:cname="READY1" edc:nzwidth="0x1" edc:desc="DAC 1 Startup Ready"/>
            <edc:SFRFieldDef edc:cname="EOC0" edc:nzwidth="0x1" edc:desc="DAC 0 End of Conversion"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:nzwidth="0x1" edc:desc="DAC 1 End of Conversion"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="SYNCBUSY" edc:nzwidth="0x20" edc:access="--------------------------rrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F" edc:_addr="0x43002408">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="DAC Enable Status"/>
            <edc:SFRFieldDef edc:cname="DATA0" edc:nzwidth="0x1" edc:desc="Data DAC 0"/>
            <edc:SFRFieldDef edc:cname="DATA1" edc:nzwidth="0x1" edc:desc="Data DAC 1"/>
            <edc:SFRFieldDef edc:cname="DATABUF0" edc:nzwidth="0x1" edc:desc="Data Buffer DAC 0"/>
            <edc:SFRFieldDef edc:cname="DATABUF1" edc:nzwidth="0x1" edc:desc="Data Buffer DAC 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="DACCTRL0" edc:nzwidth="0x10" edc:access="--------nn--nnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xCF" edc:_addr="0x4300240C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="LEFTADJ" edc:nzwidth="0x1" edc:desc="Left Adjusted Data"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable DAC0"/>
            <edc:SFRFieldDef edc:cname="CCTRL" edc:nzwidth="0x2" edc:desc="Current Control">
              <edc:SFRFieldSemantic edc:cname="CC100K" edc:desc="100kSPS" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CC1M" edc:desc="500kSPS" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CC12M" edc:desc="1MSPS" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:SFRFieldDef edc:cname="DITHER" edc:nzwidth="0x1" edc:desc="Dithering Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="DACCTRL1" edc:nzwidth="0x10" edc:access="--------nn--nnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xCF" edc:_addr="0x4300240E">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="LEFTADJ" edc:nzwidth="0x1" edc:desc="Left Adjusted Data"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable DAC0"/>
            <edc:SFRFieldDef edc:cname="CCTRL" edc:nzwidth="0x2" edc:desc="Current Control">
              <edc:SFRFieldSemantic edc:cname="CC100K" edc:desc="100kSPS" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CC1M" edc:desc="500kSPS" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CC12M" edc:desc="1MSPS" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:SFRFieldDef edc:cname="DITHER" edc:nzwidth="0x1" edc:desc="Dithering Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="DATA0" edc:nzwidth="0x10" edc:access="wwwwwwwwwwwwwwww" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:_addr="0x43002410">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x10" edc:desc="DAC0 Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
