Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG60_DFP/1.0.17/edc/PIC32CX1025SG60128.PIC
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="ALARM0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:addr="0x40002420">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="SECOND" edc:nzwidth="0x6" edc:desc="Second"/>
            <edc:SFRFieldDef edc:cname="MINUTE" edc:nzwidth="0x6" edc:desc="Minute"/>
            <edc:SFRFieldDef edc:cname="HOUR" edc:nzwidth="0x5" edc:desc="Hour">
              <edc:SFRFieldSemantic edc:cname="AM" edc:desc="Morning hour" edc:when="(field &amp; 0x1F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PM" edc:desc="Afternoon hour" edc:when="(field &amp; 0x1F) == 0x10"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DAY" edc:nzwidth="0x5" edc:desc="Day"/>
            <edc:SFRFieldDef edc:cname="MONTH" edc:nzwidth="0x4" edc:desc="Month"/>
            <edc:SFRFieldDef edc:cname="YEAR" edc:nzwidth="0x6" edc:desc="Year"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="MASK0" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:addr="0x40002424">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="SEL" edc:nzwidth="0x3" edc:desc="Alarm Mask Selection">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Alarm Disabled" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SS" edc:desc="Match seconds only" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="MMSS" edc:desc="Match seconds and minutes only" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="HHMMSS" edc:desc="Match seconds, minutes, and hours only" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="DDHHMMSS" edc:desc="Match seconds, minutes, hours, and days only" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="MMDDHHMMSS" edc:desc="Match seconds, minutes, hours, days, and months only" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="YYMMDDHHMMSS" edc:desc="Match seconds, minutes, hours, days, months, and years" edc:when="(field &amp; 0x7) == 0x06"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="ALARM1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:addr="0x40002428">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="SECOND" edc:nzwidth="0x6" edc:desc="Second"/>
            <edc:SFRFieldDef edc:cname="MINUTE" edc:nzwidth="0x6" edc:desc="Minute"/>
            <edc:SFRFieldDef edc:cname="HOUR" edc:nzwidth="0x5" edc:desc="Hour">
              <edc:SFRFieldSemantic edc:cname="AM" edc:desc="Morning hour" edc:when="(field &amp; 0x1F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PM" edc:desc="Afternoon hour" edc:when="(field &amp; 0x1F) == 0x10"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DAY" edc:nzwidth="0x5" edc:desc="Day"/>
            <edc:SFRFieldDef edc:cname="MONTH" edc:nzwidth="0x4" edc:desc="Month"/>
            <edc:SFRFieldDef edc:cname="YEAR" edc:nzwidth="0x6" edc:desc="Year"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="MASK1" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:addr="0x4000242C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="SEL" edc:nzwidth="0x3" edc:desc="Alarm Mask Selection">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Alarm Disabled" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SS" edc:desc="Match seconds only" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="MMSS" edc:desc="Match seconds and minutes only" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="HHMMSS" edc:desc="Match seconds, minutes, and hours only" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="DDHHMMSS" edc:desc="Match seconds, minutes, hours, and days only" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="MMDDHHMMSS" edc:desc="Match seconds, minutes, hours, days, and months only" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="YYMMDDHHMMSS" edc:desc="Match seconds, minutes, hours, days, months, and years" edc:when="(field &amp; 0x7) == 0x06"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="TIMESTAMP" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:addr="0x40002464">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="SECOND" edc:nzwidth="0x6" edc:desc="Second Timestamp Value"/>
            <edc:SFRFieldDef edc:cname="MINUTE" edc:nzwidth="0x6" edc:desc="Minute Timestamp Value"/>
            <edc:SFRFieldDef edc:cname="HOUR" edc:nzwidth="0x5" edc:desc="Hour Timestamp Value">
              <edc:SFRFieldSemantic edc:cname="AM" edc:desc="AM when CLKREP in 12-hour" edc:when="(field &amp; 0x1F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PM" edc:desc="PM when CLKREP in 12-hour" edc:when="(field &amp; 0x1F) == 0x10"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DAY" edc:nzwidth="0x5" edc:desc="Day Timestamp Value"/>
            <edc:SFRFieldDef edc:cname="MONTH" edc:nzwidth="0x4" edc:desc="Month Timestamp Value"/>
            <edc:SFRFieldDef edc:cname="YEAR" edc:nzwidth="0x6" edc:desc="Year Timestamp Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:RegisterMap>
    <edc:RegisterMap edc:id="SERCOM0/I2CM">
      <edc:SFRDef ltx:memberofperipheral="SERCOM0" edc:cname="CTRLA" edc:nzwidth="0x20" edc:access="-nnnn-nnnnnn---n--------n--nnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7BF1009F" edc:addr="0x40003000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM0">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:nzwidth="0x3" edc:desc="Operating Mode">
              <edc:SFRFieldSemantic edc:cname="USART_EXT_CLK" edc:desc="USART with external clock" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="USART_INT_CLK" edc:desc="USART with internal clock" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SPI_SLAVE" edc:desc="SPI in slave operation" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SPI_MASTER" edc:desc="SPI in master operation" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="I2C_SLAVE" edc:desc="I2C slave operation" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="I2C_MASTER" edc:desc="I2C master operation" edc:when="(field &amp; 0x7) == 0x05"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="PINOUT" edc:nzwidth="0x1" edc:desc="Pin Usage"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SDAHOLD" edc:nzwidth="0x2" edc:desc="SDA Hold Time">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Disabled" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="75NS" edc:desc="50-100ns hold time" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="450NS" edc:desc="300-600ns hold time" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="600NS" edc:desc="400-800ns hold time" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MEXTTOEN" edc:nzwidth="0x1" edc:desc="Master SCL Low Extend Timeout"/>
            <edc:SFRFieldDef edc:cname="SEXTTOEN" edc:nzwidth="0x1" edc:desc="Slave SCL Low Extend Timeout"/>
            <edc:SFRFieldDef edc:cname="SPEED" edc:nzwidth="0x2" edc:desc="Transfer Speed">
              <edc:SFRFieldSemantic edc:cname="STANDARD_AND_FAST_MODE" edc:desc="Standard Mode(Sm) Upto 100kHz and Fast Mode(Fm) Upto 400kHz " edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="FASTPLUS_MODE" edc:desc="Fast-mode Plus Upto 1MHz" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_SPEED_MODE" edc:desc="High-speed mode Upto 3.4MHz" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SCLSM" edc:nzwidth="0x1" edc:desc="SCL Clock Stretch Mode"/>
            <edc:SFRFieldDef edc:cname="INACTOUT" edc:nzwidth="0x2" edc:desc="Inactive Time-Out">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Disabled" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="55US" edc:desc="5-6 SCL Time-Out(50-60us)" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="105US" edc:desc="10-11 SCL Time-Out(100-110us)" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="205US" edc:desc="20-21 SCL Time-Out(200-210us)" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LOWTOUTEN" edc:nzwidth="0x1" edc:desc="SCL Low Timeout Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
